## Net revenue

In [40]:
import pandas as pd
import numpy as np

In [41]:
#test phase
df = pd.DataFrame([[10,20,23,52],
                   [85,98,45,44],
                   [85,45,65,54]],
                   index= list("xyz"),
                   columns= list("abcd")
                  )

df

    a   b   c   d
x  10  20  23  52
y  85  98  45  44
z  85  45  65  54

In [42]:
df['a']+df['b']

x     30
y    183
z    130
dtype: int64

In [43]:
df.loc['x']

a    10
b    20
c    23
d    52
Name: x, dtype: int64

In [44]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35, 'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35, 'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5, 'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3, 'retail_price':5, 'sales':300},
               ])

df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [45]:
total = (df['retail_price']-df['wholesale_price'])*df['sales']
total

0    50000.0
1    40000.0
2    20000.0
3      100.0
4      600.0
dtype: float64

In [46]:
total.sum()

np.float64(110700.0)

For what products is the retail price more than twice the wholesale price?

In [47]:
df[df['wholesale_price'] * 2 < df['retail_price']]

   product_id            name  wholesale_price  retail_price  sales
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500

In [48]:
df['name'][df['wholesale_price'] * 2 < df['retail_price']]

1    Python Workout
2    Pandas Workout
Name: name, dtype: object

after giving 30% discount on the wholesell price, calculate the new net income.

In [49]:
total = (df['retail_price']-(df['wholesale_price'])- (df['wholesale_price']*0.3))*df['sales']
total.sum()

np.float64(79650.0)